# RbsElecPanelBranchCircuitCurrentPhasea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelBranchCircuitCurrentPhasea Property
ParameterTypeId Class See Also
---
"Branch Circuit Current Phase A"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelBranchCircuitCurrentPhasea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelBranchCircuitCurrentPhasea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelBranchCircuitCurrentPhasea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace